tap "thoughtbot/formulae"

brew "git" # Apple's git is usually outdated and lacks of CVE patches

brew "ccat"
brew "tree"
brew "pstree"
brew "thoughtbot/formulae/rcm"
brew "hub"
brew "rbenv"
brew "awscli"
brew "terraform"
brew "terragrunt"
brew "packer"

cask "google-chrome"
cask "1password"
cask "grammarly"
cask "iterm2"
cask "spectacle"
cask "gpg-suite"
cask "tunnelblick"
cask "sublime-text"
cask "skype"
cask "slack"
cask "telegram"
cask "rubymine"
cask "the-unarchiver"
cask "transmission"
cask "dropbox"
cask "docker"
cask "shuttle"
cask "freemind"
cask "keybase"
cask "fork"
cask "android-file-transfer"
cask "omnigraffle"
cask "java"
cask "vlc"
cask "wireshark"
cask "amazon-chime"
