tap "beeftornado/rmtree"
tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"

brew "autoconf"
brew "awscli"
brew "bdw-gc"
brew "bison"
brew "boost"
brew "chromedriver"
brew "cowsay"
brew "ctop"
brew "jpeg"
brew "elixir"
brew "fish"
brew "git-flow"
brew "git-secret"
brew "lua"
brew "libtool"
brew "graphviz"
brew "highlight"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "libevent"
brew "libpcl"
brew "libyaml"
brew "mas"
brew "mongodb", restart_service: true
brew "monit"
brew "mysql", restart_service: true
brew "neo4j"
brew "node"
brew "phantomjs"
brew "postgresql"
brew "pstree"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "terraform"
brew "tree"
brew "tsung"
brew "unixodbc"
brew "thoughtbot/formulae/rcm"

cask "java"
cask "1password"
cask "araxis-merge"
cask "ccmenu"
cask "docker"
cask "freemind"
cask "gpgtools"
cask "karabiner-elements"
cask "kitematic"
cask "microsoft-remote-desktop-beta"
cask "ngrok"
cask "omnigraffle"
cask "shuttle"
cask "slack"
cask "spectacle"
cask "tunnelblick"
cask "virtualbox"

mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Wire", id: 931134707
mas "Wunderlist", id: 410628904
