brew "git" # Apple's git is usually outdated and lacks of CVE patches

# Utilities
# brew "ccat"
brew "bat"
brew "tree"
brew "pstree"
brew "thoughtbot/formulae/rcm"
brew "hub"
# brew "remotemobprogramming/brew/mob"
# brew "zaquestion/tap/lab" # Like hub, but for GitLab
brew "awscli"
brew "duf" # `df` on steroids
brew "sipcalc" # Calculate IP
brew "httpie"
# brew "exa" # `ls` on steroids
brew "diff-so-fancy" # Enhanced diff
brew "jq"
brew "k6" # Load testing
brew "nmap" # Nework ports scanning
brew "pre-commit"
brew "asciinema"

# Terraform / Terragrunt
brew "warrensbox/tap/tfswitch" # Terraform installer & switcher
brew "tgswitch"
brew "tflint"
brew "tfsec"
brew "terraform-docs"
# brew "iam-policy-json-to-terraform"
# brew "packer"

# Ruby
brew "rbenv"

# whalebrew "whalebrew/wget"
# whalebrew "tsub/graph-easy"

# Docker
brew "dive" # Introspect Docker images

# Kubernetes
brew "k9s"

# LiveLink
brew "lastpass-cli"
brew "saml2aws"
cask "google-cloud-sdk"
cask "chef-workstation" # Run "uninstall_chef_workstation" in terminal in case of deletion
# brew "rbenv-chefdk" # Treat ChefDK as another version in rbenv

cask "google-chrome"
cask "1password"
cask "1password-cli"
cask "grammarly" # Desktop Editor
cask "iterm2"
cask "rectangle"
# cask "gpg-suite"
# cask "tunnelblick" # ClearVPN
cask "sublime-text"
cask "skype"
cask "slack"
cask "telegram"
cask "viber"
cask "zoom"
cask "whatsapp"
cask "rubymine"
cask "the-unarchiver"
cask "transmission"
cask "docker"
# cask "shuttle"
# cask "freemind"
# cask "keybase"
cask "fork"
# cask "android-file-transfer"
# cask "omnigraffle"
# cask "java" # ==> java has been moved from casks
  # brew uninstall --cask --force java
# cask "vlc"
# cask "amazon-chime"
# cask "keepingyouawake"
# cask "visual-studio-code"

# Virtualization
cask "vagrant"
# cask "virtualbox" # Does not work with darwin/arm64 arch in 11.08.2022
cask "vmware-fusion"

# Network
cask "wireshark"
cask "gns3" # network simulator
cask "zenmap" # Network ports scanning on top of nmap (very old fashion)
cask "wifi-explorer" # Analysize Wi-Fi networks around
